In [2]:
import numpy as np
import pandas as pd

Open excel file:

In [3]:
df_orig = pd.read_excel(
    "https://github.com/dm-fedorov/pandas_basic/blob/master/%D0%B1%D1%8B%D1%81%D1%82%D1%80%D0%BE%D0%B5%20%D0%B2%D0%B2%D0%B5%D0%B4%D0%B5%D0%BD%D0%B8%D0%B5%20%D0%B2%20pandas/data/sales_cleanup.xlsx?raw=True"
)
df = df_orig.copy()
df

         Customer      Sales
0  Jones Brothers        500
1       Beta Corp  $1,000.00
2     Globex Corp      300.1
3            Acme    $750.01
4         Initech        300
5           Hooli        250

we created a copy df to make it easier to work

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Customer  6 non-null      object
 1   Sales     6 non-null      object
dtypes: object(2)
memory usage: 228.0+ bytes

Just type objects and memory usage

In [5]:
df.dtypes

Customer    object
Sales       object
dtype: object

It's right to do this

In [6]:
df["Sales"] = df["Sales"].str.replace("$", "")
df["Sales"] = df["Sales"].str.replace(",", "")
df["Sales"]

0        NaN
1    1000.00
2        NaN
3     750.01
4        NaN
5        NaN
Name: Sales, dtype: object

some values have been converted to NaN

In [7]:
df = df_orig.copy()
df["Sales"].apply(type)

0      <class 'int'>
1      <class 'str'>
2    <class 'float'>
3      <class 'str'>
4      <class 'int'>
5      <class 'int'>
Name: Sales, dtype: object

for visualization, we will create an additional column with data types

In [8]:
df["Sales_type"] = df["Sales"].apply(
    type
)  # or func. prog df["Sales"].apply(lamda x: type(x).__name__)
df

         Customer      Sales       Sales_type
0  Jones Brothers        500    <class 'int'>
1       Beta Corp  $1,000.00    <class 'str'>
2     Globex Corp      300.1  <class 'float'>
3            Acme    $750.01    <class 'str'>
4         Initech        300    <class 'int'>
5           Hooli        250    <class 'int'>

counting types:

In [9]:
df["Sales"].apply(type).value_counts()

Sales
<class 'int'>      3
<class 'str'>      2
<class 'float'>    1
Name: count, dtype: int64

In [10]:
number = 1235
number_string = "$1,235"
type(number), type(number_string)

(int, str)

In [11]:
number_string.replace("$", "").replace(",", "")

'1235'

In [12]:
def clean_currency(x):
    """
    if str, del symbols,else for
    """
    if isinstance(x, str):
        return x.replace("$", "").replace(",", "")
    return x

In [13]:
df["Sales"] = (
    df["Sales"].apply(clean_currency).astype("float")
)  # apply can allows us to use custom functions

In [14]:
df["Sales"]

0     500.00
1    1000.00
2     300.10
3     750.01
4     300.00
5     250.00
Name: Sales, dtype: float64

In [15]:
df["Sales_type"] = df["Sales"].apply(lambda x: type(x).__name__)

In [16]:
df["Sales_type"]

0    float
1    float
2    float
3    float
4    float
5    float
Name: Sales_type, dtype: object

In [17]:
df

         Customer    Sales Sales_type
0  Jones Brothers   500.00      float
1       Beta Corp  1000.00      float
2     Globex Corp   300.10      float
3            Acme   750.01      float
4         Initech   300.00      float
5           Hooli   250.00      float

In [18]:
df.dtypes

Customer       object
Sales         float64
Sales_type     object
dtype: object

In [19]:
df["Sales"].apply(type).value_counts()

Sales
<class 'float'>    6
Name: count, dtype: int64

in one line, everything that was done above

1. check if x str
2. if str do replace to replace, else return x
3. astype "float"

In [20]:
df = df_orig.copy()
df["Sales"] = (
    df["Sales"]
    .apply(lambda x: x.replace("$", "").replace(",", "") if isinstance(x, str) else x)
    .astype("float")
)
df["Sales"]

0     500.00
1    1000.00
2     300.10
3     750.01
4     300.00
5     250.00
Name: Sales, dtype: float64